cf/Documents/УстановкаПроцентаСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаПроцентаСкидки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СкидкиПоЦеновымГруппам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньСкидки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УровниСкидок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/УстановкаПроцентаСкидки/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("	ВЫБРАТЬ
							|	Ссылка.ДатаНачала	Период,
							|	ЦеноваяГруппа		ЦеноваяГруппа,
							|	УровеньСкидки		УровеньСкидки,
							|	ПроцентСкидки		ПроцентСкидки
							|ИЗ
							|	Документ.УстановкаПроцентаСкидки.Скидки
							|ГДЕ
							|	Ссылка = &Ссылка");
							
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выполнение = Запрос.Выполнить();
	
	ДополнительныеСвойства.Вставить("СкидкиПоЦеновымГруппам", 	Выполнение.Выгрузить());
	
КонецПроцедуры
